n3tk0/ESP32_Logger/src/espnow/EspNowIngest.cpp
#include "EspNowIngest.h"

#ifdef FEATURE_ESPNOW_INGEST

#include <esp_idf_version.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <LittleFS.h>
#include <WiFi.h>
#include <string.h>
#include <time.h>
#include <Preferences.h>

#include "EspNowAuth.h"
#include "../nodes/NodeCfgStore.h"  // remote configuration, docs/NODE_CONFIG.md §5
#include "../nodes/NodeFwStore.h"   // firmware updates, docs/NODE_OTA.md §4
#include "../core/EventLog.h"   // the clock-skew warning outlives the serial cable
#include "../core/Globals.h"    // bootCount, to tie a log line to a boot
#include "../pipeline/DataPipeline.h"   // fsMutex
#include "../sensors/RemoteIngest.h"
#include "../utils/MutexGuard.h"

// ============================================================================
// WHICH TASK DOES WHAT, AND WHY IT MATTERS
// ============================================================================
// Two tasks touch the state in this file:
//
//   the WiFi task    runs onRecv(). Validates the frame, sends the ACK, and
//                    parks the rest. Nothing else.
//   an ordinary task runs espnowIngestTick() from loop(). Does all the
//                    thinking: sequence numbers, battery history, the
//                    handshake, the filesystem, and the handoff to
//                    RemoteIngest.
//
// The split is not stylistic. ESP-IDF's own documentation says the receive
// callback runs on the WiFi task and that lengthy work there is a mistake,
// and "lengthy" covers an HMAC, a flash write, and a walk of a 32-entry
// mailbox — all of which the naive version of this file did inside the
// callback.
//
// THE ONE EXCEPTION is the ACK, which IS sent from the callback. The node is
// holding its radio in receive waiting for it and every millisecond of that
// wait is battery it does not get back. Handing the reply to another task
// first would be tidier and would cost the node exactly the thing the reply
// exists to be. esp_now_send() queues to the driver and does not block, so it
// stays short.
//
// If that turns out to misbehave from inside the callback on real hardware,
// the fix is a small high-priority task fed by this same ring: the node
// tolerates tens of milliseconds, so a task hop is affordable. It is written
// this way first because it is simpler. This is the choice in this file most
// likely to need revisiting on a board.
//
// LOCKING
// -------
// One spinlock for the node table, one for the ring. Neither is ever held
// while the other is taken, and — the rule that matters — the node lock is
// never held across a RemoteIngest::put(), which takes a spinlock of its own.
// The tick does its integer bookkeeping under the lock, copies out what it
// needs, releases, and only then hands readings on.
// ============================================================================

// ---------------------------------------------------------------------------
// Keys
// ---------------------------------------------------------------------------
// One shared key for every node, set at build time and flashed into both
// sides:
//
//   -DFEATURE_ESPNOW_INGEST -DESPNOW_LMK='"16-byte-secret!!"'
//
// A per-node key would be better — one compromised node would then not be
// every node — but it needs somewhere to store eight of them and a UI to
// enter them, and this feature has neither yet. For one to three nodes on a
// home network the shared key is the right trade, and it is written down here
// rather than left for someone to discover.
//
// The PMK encrypts the LMK on the air during peer setup. It is not a secret
// in the same sense — both ends must simply agree — but it must be 16 bytes.
#ifndef ESPNOW_LMK
#  define ESPNOW_LMK "change-this-key!"
#endif
#ifndef ESPNOW_PMK
#  define ESPNOW_PMK "esp32-logger-pmk"
#endif

// sizeof includes the terminator, so 17 is a 16-character key. A shorter one
// would read past the literal when copied into esp_now_peer_info_t::lmk.
static_assert(sizeof(ESPNOW_LMK) == 17, "ESPNOW_LMK must be exactly 16 characters");
static_assert(sizeof(ESPNOW_PMK) == 17, "ESPNOW_PMK must be exactly 16 characters");

// ESPNOW_BOOT_PAIRING_S now lives in EspNowIngest.h: the web interface's
// pairing button defaults to the same duration, and two copies of a number
// two files apart is one copy too many.

static const char* NODES_FILE = "/espnow_nodes.bin";

/// Bumped when EspNowNode's layout changes, so a stale file is discarded
/// rather than read as garbage. The file holds raw structs — it is internal,
/// small, and rewritten whole — so there is nothing to migrate.
static const uint32_t NODES_MAGIC = 0x454E3031;  // "EN01"

// ---------------------------------------------------------------------------
// State
// ---------------------------------------------------------------------------

static EspNowNodeTable   s_nodes;
static portMUX_TYPE      s_nodeMux = portMUX_INITIALIZER_UNLOCKED;

static EspNowIngestStats s_stats;
static bool              s_up          = false;
static uint32_t          s_pairUntilMs = 0;
static bool              s_dirty       = false;   ///< table changed, needs saving
static uint32_t          s_lastDay     = 0;       ///< last day written to flash
static uint8_t           s_offlineIntervals = 0;  // 0 = use ESPNOW_OFFLINE_INTERVALS

/// Frames the callback parked for the tick to deal with.
///
/// Four slots: several nodes reporting on the same second is the only way to
/// fill it, and the tick runs every loop() iteration. Overflow is counted
/// rather than silently dropped, because "the ring filled" and "nothing ever
/// arrived" are very different problems with the same symptom.
///
/// The frame is kept as it arrived rather than decoded: DATA, DATA2 and
/// CFG_ACK all come through here, and DATA2 is variable length. The tick
/// decodes; the callback only proves (espnowValidate) that it can.
struct RxFrame {
    uint8_t mac[6];   ///< kept for the log line when a frame names no known node
    uint8_t type;     ///< EN_MSG_DATA, EN_MSG_DATA2, EN_MSG_CFG_ACK or EN_MSG_FW_DONE
    uint8_t len;
    uint8_t buf[ESPNOW_MAX_FRAME];
};
static const int    RX_RING = 4;
static RxFrame      s_ring[RX_RING];
static int          s_ringHead = 0;    ///< advanced by the tick
static int          s_ringTail = 0;    ///< advanced by the callback
static portMUX_TYPE s_ringMux  = portMUX_INITIALIZER_UNLOCKED;

/// One pending DISCOVER, waiting for the tick to verify its signature.
///
/// One slot and not a queue: pairing is a human-initiated, one-node-at-a-time
/// act, and a node that is ignored because another was mid-handshake simply
/// sweeps and tries again. A queue here would be machinery for a case that
/// does not happen.
static DiscoverMsg s_pendingDiscover;
static uint8_t     s_pendingMac[6];
static volatile bool s_pendingValid = false;

// ---------------------------------------------------------------------------
// Remote configuration — what the receive callback needs, mirrored
// ---------------------------------------------------------------------------
// The config store (src/nodes/NodeCfgStore) lives behind a mutex and a
// filesystem, and the receive callback may take neither. So the tick copies
// in, per table slot and under s_nodeMux, exactly what the callback answers
// from:
//
//   s_cfgHave/Rev  whether a config is held and its desired rev — enough to
//                  work out the rev a CFG_REPORT is adopted at (ncr::planReport)
//                  and answer it at once, while the node is still listening;
//   s_cfgDoc       the desired config, already rendered as the radio carries
//                  it, for a node that is due one — so a CFG_GET is a memcpy of
//                  one slice and a send, not a file read and a JSON encode.
//                  Heap, and only while that node is pending: a few hundred
//                  bytes each, freed once it has applied;
//   s_cfgPend      the ACK flag (EN_ACK_CFG_PENDING): set only once the doc is
//                  ready, so a node is never told to ask for something that
//                  is not there to be sent.
//
// Refreshed whenever the store's generation moves (or the table changes).
// Parallel arrays and not EspNowNode fields for the reason the skew array
// gives: the table is persisted as raw structs.
static bool      s_cfgHave[EspNowNodeTable::CAP]   = {false};
static bool      s_cfgPend[EspNowNodeTable::CAP]   = {false};
static uint16_t  s_cfgRev[EspNowNodeTable::CAP]    = {0};
static char*     s_cfgDoc[EspNowNodeTable::CAP]    = {nullptr};
static uint16_t  s_cfgDocLen[EspNowNodeTable::CAP] = {0};
static uint16_t  s_cfgDocRev[EspNowNodeTable::CAP] = {0};
static uint32_t  s_cfgMirrorGen = 0;   ///< store generation mirrored; 0 = resync

/// One CFG_REPORT being reassembled, and one completed one waiting for the
/// tick to adopt. One and not one per node (a whole report is 1 KB): a node
/// reports on its first wake after boot and after a local edit, rarely two at
/// once — except after a power cut, when every node boots together. So a
/// transfer in progress is HELD: another node's first slice is dropped while
/// the current one's last slice is under EN_CFG_HOLD_MS old (espnowCfgHeld()),
/// rather than wiping it, and a stalled one is given up after that. Every
/// complete report is answered (CFG, total 0), the one after a boot as well
/// as a local one, and a node keeps reporting — on later wakes, under its
/// report backoff — until it hears that answer. So a node that lost the slot
/// (its slices dropped, or the tick had not yet taken the last report) has
/// its report land on a later wake instead of at its next boot.
static EnCfgAssembler  s_asm;
static uint32_t        s_asmMs = 0;             ///< millis() of s_asm's last accepted slice
static ncr::ReportPlan s_reportPlan;            ///< what the callback decided (and said)
static volatile bool   s_reportReady = false;   ///< s_asm holds a complete report

/// The last local report adopted per slot — a hash of its bytes and rev — and
/// the rev it was adopted at. A node that missed the answer repeats the same
/// report on a later wake (§5) and must be told the same rev, not adopted
/// again at a new one.
static uint32_t s_repHash[EspNowNodeTable::CAP] = {0};
static uint16_t s_repRev[EspNowNodeTable::CAP]  = {0};

// ---------------------------------------------------------------------------
// Firmware updates — docs/NODE_OTA.md §4
// ---------------------------------------------------------------------------
// Same arrangement as the config: the store (src/nodes/NodeFwStore) is behind
// a mutex and an SD card, so the tick mirrors what the callback answers from.
//
//   s_fwSt     per slot, under s_nodeMux: the node's target status — the ACK
//              flag (nfr::ackFlag) and whether a FW_GET is served at all;
//   s_fwImg    under s_fwMux: the image's id, size, minMv, attempt, serial;
//   s_fwServe  under s_fwMux: the two 4 KB windows of it (nfr::Serve), which
//              the callback answers from and the tick fills from SD.
//
// One transfer at a time (s_fwOwner): a C3 image is ~1 MB and 8 KB of windows
// is what the collector can spare, not 8 KB per node. The buffer exists only
// while a transfer is live and is freed by the tick after nfr::IDLE_MS of
// silence. Only the tick allocates, fills and frees it; the callback only
// reads a window the tick has published.
//
// Its own spinlock, not s_nodeMux: the callback takes s_nodeMux for the slot
// and releases it before s_fwMux, so the two are never held together.
static uint8_t      s_fwSt[EspNowNodeTable::CAP] = {0};
static uint32_t     s_fwMirrorGen = 0;   ///< store generation mirrored; 0 = resync
static portMUX_TYPE s_fwMux       = portMUX_INITIALIZER_UNLOCKED;
static NodeFwImage  s_fwImg       = {};  ///< size 0 = no image
static nfr::Serve   s_fwServe     = { {{0, 0}, {0, 0}}, -1, 0, false, 0, 0 };
static uint8_t*     s_fwBuf       = nullptr;   ///< 2 × nfr::WIN, while a transfer is live
static uint8_t      s_fwOwner     = 0;         ///< node id of the transfer, 0 = none
static uint32_t     s_fwLastMs    = 0;         ///< millis() of its last FW_GET
static uint32_t     s_fwProgOff   = 0;         ///< its last requested offset...
static bool         s_fwProg      = false;     ///< ...not yet handed to the store

// ---------------------------------------------------------------------------
// How far each node's clock is from ours
// ---------------------------------------------------------------------------
// Measured HERE and not reported by the node, because the node is the one with
// a battery. Every DATA frame already carries the node's own epoch, and this
// collector has a real clock, so the difference is free: no extra byte on the
// air, no extra wake, and — the part that matters on a device that deep sleeps
// — not one flash write on the node to record something only readable with a
// cable attached.
//
// Kept beside the table rather than inside EspNowNode. Adding a field there
// changes sizeof(), which makes loadNodes() discard the saved file and costs
// every deployed node a re-pair. A live measurement retaken on the next report
// has no business surviving a reboot at that price.
//
// Positive means the node is BEHIND us, which is the direction an RC-timed
// deep sleep drifts.
static int32_t s_skew[EspNowNodeTable::CAP]      = {0};
static bool    s_haveSkew[EspNowNodeTable::CAP]  = {false};
/// millis() of the last log line per node, so a badly drifting node writes
/// one line an hour and not one a minute.
static uint32_t s_skewLoggedMs[EspNowNodeTable::CAP] = {0};

#ifndef ESPNOW_SKEW_WARN_S
#  define ESPNOW_SKEW_WARN_S 60
#endif
#ifndef ESPNOW_SKEW_LOG_INTERVAL_MS
#  define ESPNOW_SKEW_LOG_INTERVAL_MS 3600000UL
#endif

// ---------------------------------------------------------------------------
// Small helpers
// ---------------------------------------------------------------------------

static inline uint32_t nowEpoch() {
    const uint32_t t = (uint32_t)time(nullptr);
    // Below this the clock has never been set, and telling a node it is 1970
    // is worse than telling it nothing: it would timestamp a buffered burst
    // with a date that is then thrown away at the far end.
    return (t >= 1000000000u) ? t : 0;
}

