n3tk0/ESP32_Logger/src/espnow/EspNowIngest.cpp
static inline uint8_t currentChannel() {
    uint8_t ch = 0;
    wifi_second_chan_t sec;
    if (esp_wifi_get_channel(&ch, &sec) != ESP_OK) return 0;
    return ch;
}

// ---------------------------------------------------------------------------
// Persistence
// ---------------------------------------------------------------------------
// The node table has to survive a reboot or provisioning is lost every time
// the power blinks — and with it the battery history, which takes five days
// to rebuild before batteryDaysLeft() will answer again.
//
// Written whole, never in place: eight structs is well under a flash page,
// and a full rewrite cannot leave a half-updated record behind.
//
// Called only from the tick, so the node lock is taken here rather than by
// the caller. Nothing else in this file writes the filesystem.

// Persisting the node table, with a retry that is not a spin.
//
// s_dirty stays set when the write fails, which is right — the table still
// needs saving — but the tick runs from loop(), so "still needs saving" meant
// retrying the open thousands of times a second and printing a line each time.
// A full or broken filesystem does not heal inside a millisecond, and the log
// it produced would bury whatever else was wrong.
//
// So a failure buys a minute of quiet. The flag is untouched, so the retry
// still happens; it just happens at a rate that matches how fast a filesystem
// fault can plausibly clear.
static uint32_t s_saveRetryAtMs = 0;   ///< millis() before which not to retry

static bool saveNodes() {
    // Signed difference, so this stays correct across the millis() wrap.
    if (s_saveRetryAtMs != 0 && (int32_t)(s_saveRetryAtMs - millis()) > 0) return false;

    EspNowNode snap[EspNowNodeTable::CAP];
    taskENTER_CRITICAL(&s_nodeMux);
    for (int i = 0; i < EspNowNodeTable::CAP; i++) snap[i] = s_nodes.at(i);
    taskEXIT_CRITICAL(&s_nodeMux);

    // Pillar 1.3: every LittleFS write call site takes fsMutex. The tick runs
    // from loop() and StorageTask appends to the day's CSV on its own task —
    // LittleFS is not re-entrant across tasks, and two writers in its metadata
    // at once corrupt the directory or panic the core without either failure
    // naming the code that caused it. Taken after the snapshot above, so the
    // node spinlock and this mutex are never held at the same time.
    MutexGuard guard(fsMutex, pdMS_TO_TICKS(2000));
    if (fsMutex && !guard.isLocked()) {
        Serial.println("[ESPNOW] fsMutex timeout — retrying in 60 s");
        s_saveRetryAtMs = millis() + 60000u;
        if (s_saveRetryAtMs == 0) s_saveRetryAtMs = 1;
        return false;
    }

    File f = LittleFS.open(NODES_FILE, "w");
    if (!f) {
        Serial.println("[ESPNOW] could not open the node file for writing "
                       "— retrying in 60 s");
        s_saveRetryAtMs = millis() + 60000u;
        if (s_saveRetryAtMs == 0) s_saveRetryAtMs = 1;   // 0 means "no backoff"
        return false;
    }
    f.write((const uint8_t*)&NODES_MAGIC, sizeof(NODES_MAGIC));
    for (int i = 0; i < EspNowNodeTable::CAP; i++)
        f.write((const uint8_t*)&snap[i], sizeof(snap[i]));
    f.close();
    s_dirty = false;
    s_saveRetryAtMs = 0;
    return true;
}

static void loadNodes() {
    // Same lock as saveNodes(), and needed for the same reason: this runs from
    // espnowIngestBegin(), which loop() calls once the network is up — after
    // TaskManager::init(), so StorageTask is already writing. The discards
    // below are removes, which is a write however it is spelled.
    MutexGuard guard(fsMutex, pdMS_TO_TICKS(2000));
    if (fsMutex && !guard.isLocked()) {
        Serial.println("[ESPNOW] fsMutex timeout — the node table starts empty");
        return;
    }

    if (!LittleFS.exists(NODES_FILE)) return;

    File f = LittleFS.open(NODES_FILE, "r");
    if (!f) return;

    const size_t want = sizeof(NODES_MAGIC) +
                        sizeof(EspNowNode) * (size_t)EspNowNodeTable::CAP;
    if (f.size() != want) {
        // A layout change, not corruption. Discard rather than reinterpret:
        // reading one struct as another produces nodes with plausible ids and
        // nonsense battery histories, which is worse than starting over.
        Serial.printf("[ESPNOW] node file is %u bytes, expected %u — discarding\n",
                      (unsigned)f.size(), (unsigned)want);
        f.close();
        LittleFS.remove(NODES_FILE);
        return;
    }

    uint32_t magic = 0;
    f.read((uint8_t*)&magic, sizeof(magic));
    if (magic != NODES_MAGIC) {
        Serial.println("[ESPNOW] node file magic mismatch — discarding");
        f.close();
        LittleFS.remove(NODES_FILE);
        return;
    }

    for (int i = 0; i < EspNowNodeTable::CAP; i++) {
        EspNowNode n{};
        f.read((uint8_t*)&n, sizeof(n));
        if (!n.used) continue;
        // lastSeenMs came from a previous boot's millis() and means nothing
        // now. Clearing everSeen is what makes a restored node read as
        // offline until it actually reports, rather than as freshly heard.
        n.lastSeenMs = 0;
        n.everSeen   = false;
        n.haveSeq    = false;
        taskENTER_CRITICAL(&s_nodeMux);
        s_nodes.at(i) = n;
        taskEXIT_CRITICAL(&s_nodeMux);
    }
    f.close();
    Serial.printf("[ESPNOW] restored %d node(s)\n", s_nodes.count());
}

// ---------------------------------------------------------------------------
// Peers
// ---------------------------------------------------------------------------

static bool addPeer(const uint8_t mac[6]) {
    if (esp_now_is_peer_exist(mac)) return true;

    esp_now_peer_info_t p{};
    memcpy(p.peer_addr, mac, 6);
    memcpy(p.lmk, ESPNOW_LMK, 16);
    // Channel 0 means "whatever the interface is on". The collector follows
    // its access point, so pinning a number here would break every peer the
    // first time the router moved.
    p.channel = 0;
    p.ifidx   = WIFI_IF_STA;
    p.encrypt = true;

