n3tk0/ESP32_Logger/src/espnow/EspNowIngest.cpp
    const esp_err_t rc = esp_now_add_peer(&p);
    if (rc != ESP_OK) {
        Serial.printf("[ESPNOW] add_peer failed: %d\n", (int)rc);
        return false;
    }
    return true;
}

/// The broadcast pseudo-peer. ESP-NOW will not send to an address it has not
/// been told about, and that includes ff:ff:ff:ff:ff:ff. Unencrypted of
/// necessity: a broadcast has no peer to hold a key.
static bool addBroadcastPeer() {
    static const uint8_t BCAST[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
    if (esp_now_is_peer_exist(BCAST)) return true;

    esp_now_peer_info_t p{};
    memcpy(p.peer_addr, BCAST, 6);
    p.channel = 0;
    p.ifidx   = WIFI_IF_STA;
    p.encrypt = false;
    return esp_now_add_peer(&p) == ESP_OK;
}

// ---------------------------------------------------------------------------
// The receive callback — WiFi task
// ---------------------------------------------------------------------------

/// Answer a DATA frame.
///
/// A frame from a node we do not know still gets an answer, and it carries
/// EN_ACK_REDISCOVER: that is what sends a node whose collector was reflashed
/// back through pairing, instead of leaving it transmitting for months into
/// something that will never decode it.
static void sendAck(const uint8_t* mac, uint8_t nodeId, uint16_t seq) {
    bool     known    = false;
    bool     cfg      = false;
    bool     fw       = false;
    uint16_t interval = 0;

    taskENTER_CRITICAL(&s_nodeMux);
    const int idx = s_nodes.indexOf(nodeId);
    if (idx >= 0) {
        known    = true;
        // §5: with a config held the interval travels in it; any other value
        // here would undo an applied config on the node's next wake.
        interval = s_cfgHave[idx] ? 0 : s_nodes.at(idx).intervalS;
        cfg      = s_cfgPend[idx];
        fw       = nfr::ackFlag(s_fwSt[idx]);
    }
    taskEXIT_CRITICAL(&s_nodeMux);

    AckMsg a{};
    a.magic     = ESPNOW_MAGIC;
    a.ver       = ESPNOW_PROTO_VER;
    a.type      = EN_MSG_ACK;
    a.nodeId    = nodeId;
    a.ackSeq    = seq;
    // CFG_PENDING while desired.rev > applied_rev (§5). A node built before the
    // flag ignores the bit.
    a.flags     = known ? (uint8_t)((cfg ? EN_ACK_CFG_PENDING : 0) | (fw ? EN_ACK_FW_PENDING : 0))
                        : (uint8_t)EN_ACK_REDISCOVER;
    a.epoch     = nowEpoch();
    a.intervalS = interval;
    a.channel   = currentChannel();

    if (esp_now_send(mac, (const uint8_t*)&a, sizeof(a)) == ESP_OK) s_stats.acksSent++;
}

/// The table slot of `nodeId` if `mac` is the MAC it was paired with, else
/// -1. Config frames are encrypted with the shared key, so the radio already
/// proved the sender holds it; this stops one node speaking for another.
/// Caller holds s_nodeMux.
static int slotFor(const uint8_t* mac, uint8_t nodeId) {
    const int idx = s_nodes.indexOf(nodeId);
    if (idx < 0 || memcmp(s_nodes.at(idx).mac, mac, 6) != 0) return -1;
    return idx;
}

/// Park a frame for the tick. False when the ring is full.
static bool ringPush(const uint8_t* mac, uint8_t type, const void* data, int len) {
    taskENTER_CRITICAL(&s_ringMux);
    const int next = (s_ringTail + 1) % RX_RING;
    const bool room = next != s_ringHead;
    if (room) {
        memcpy(s_ring[s_ringTail].mac, mac, 6);
        s_ring[s_ringTail].type = type;
        s_ring[s_ringTail].len  = (uint8_t)len;
        memcpy(s_ring[s_ringTail].buf, data, (size_t)len);
        s_ringTail = next;
    }
    taskEXIT_CRITICAL(&s_ringMux);
    if (!room) s_stats.ringFull++;
    return room;
}

/// espnowFillCfgChunk() for a CFG frame, out of line: one copy of the
/// framing for both answers the callback gives.
static int __attribute__((noinline)) cfgFrame(CfgChunkMsg& m, uint8_t nodeId, uint16_t rev,
                                              const char* doc, uint16_t total, uint16_t offset) {
    return espnowFillCfgChunk(m, EN_MSG_CFG, nodeId, rev, doc, total, offset);
}

/// CFG_GET: one slice of the rendered desired config, straight back (§5).
/// The node is awake and asking in a loop, max(ack window, 50 ms) per slice;
/// this is a memcpy and a send. When there is nothing newer than what the
/// node has — or nothing rendered to send — a CFG with total 0 says "up to
/// date" so it stops asking. A node asking with haveRev at the desired rev
/// already runs it (its CFG_ACK was lost): it is recorded as applied, through
/// the tick, as the CFG_ACK it will also repeat.
static void answerCfgGet(const uint8_t* mac, const uint8_t* data) {
    CfgGetMsg g;
    memcpy(&g, data, sizeof(g));
    CfgChunkMsg m;
    int  n       = -1;
    bool applied = false;
    taskENTER_CRITICAL(&s_nodeMux);
    const int idx = slotFor(mac, g.nodeId);
    if (idx >= 0) {
        const uint16_t want  = s_cfgHave[idx] ? s_cfgRev[idx] : 0;
        const bool     slice = s_cfgDoc[idx] && !ncr::revAtOrPast(g.haveRev, s_cfgDocRev[idx]);
        if (!slice) {
            applied = s_cfgPend[idx] && ncr::revAtOrPast(g.haveRev, want);
            if (applied) s_cfgPend[idx] = false;
        }
        n = slice ? cfgFrame(m, g.nodeId, s_cfgDocRev[idx], s_cfgDoc[idx], s_cfgDocLen[idx],
                             g.offset)
                  : cfgFrame(m, g.nodeId, ncr::revAtOrPast(g.haveRev, want) ? g.haveRev : want,
                             nullptr, 0, 0);
    }
    taskEXIT_CRITICAL(&s_nodeMux);
    if (n > 0) esp_now_send(mac, (const uint8_t*)&m, (size_t)n);
    if (applied) {
        CfgAckMsg a;
        espnowFillCfgAck(a, g.nodeId, g.haveRev, EN_CFG_OK, nullptr, nullptr);
        ringPush(mac, EN_MSG_CFG_ACK, &a, (int)sizeof(a));
    }
}

/// CFG_REPORT: reassemble; on the last slice answer (CFG, total 0) while the
/// node is still listening, and leave the document for the tick to store. A
/// LOCAL report is told the rev it is adopted at; any other (the one after a
/// boot) is told its own rev back — what the store records it as running
/// (it is never adopted as a local edit, and a node behind the desired rev
/// stays pending and fetches). The answer is what stops the node reporting
/// again (§5).
///
/// The rev is worked out HERE, from the mirrored desired rev, with the same
/// ncr::planReport() the store then keeps to — so the answer does not wait
/// for a flash write. `local` is read with a string search rather than a JSON
/// parse: the node writes compact JSON with the codec, so a local edit is
/// exactly `"local":true`, and no value in the document can contain a quote.
static void feedCfgReport(const uint8_t* mac, const uint8_t* data, int len) {
    if (s_reportReady) return;                  // the tick has not taken the last one
    CfgChunkMsg c;
    memcpy(&c, data, (size_t)len);
    if (c.total == 0) return;                   // the "adopted" form is ours to send

    taskENTER_CRITICAL(&s_nodeMux);
    const int idx = slotFor(mac, c.nodeId);
    taskEXIT_CRITICAL(&s_nodeMux);
    if (idx < 0) return;
    const uint32_t now = millis();
    if (espnowCfgHeld(s_asm, c, now - s_asmMs)) return;   // another node's, in progress
    const EnCfgFeed fed = espnowCfgFeed(s_asm, c);
    if (fed == EN_CFG_FEED_IGNORED) return;
    s_asmMs = now;
    if (fed != EN_CFG_FEED_DONE) return;

    const bool local = strstr(s_asm.doc, "\"local\":true") != nullptr;
    uint32_t   h     = 2166136261u ^ s_asm.rev;             // FNV-1a
    for (uint16_t i = 0; i < s_asm.total; i++) h = (h ^ (uint8_t)s_asm.doc[i]) * 16777619u;
    if (!h) h = 1;

    bool     repeat = false;
    uint16_t told   = 0;
    taskENTER_CRITICAL(&s_nodeMux);
    if (local && s_repHash[idx] == h) {
        repeat = true;
        told   = s_repRev[idx];
    } else {
        s_reportPlan = ncr::planReport(s_cfgHave[idx], s_cfgRev[idx], s_asm.rev, local);
        told         = ncr::reportAnswerRev(s_reportPlan, s_asm.rev, local);
        if (local) { s_repHash[idx] = h; s_repRev[idx] = told; }
    }
    taskEXIT_CRITICAL(&s_nodeMux);

    if (repeat) espnowCfgReset(s_asm);          // adopted already: nothing to store
    else        s_reportReady = true;
    CfgChunkMsg m;
    const int n = cfgFrame(m, c.nodeId, told, nullptr, 0, 0);
    if (n > 0) esp_now_send(mac, (const uint8_t*)&m, (size_t)n);
}

/// FW_GET (§4.2): one slice straight from a RAM window, like a CFG_GET — the
/// node is awake and asking in a loop. A slice not in a window is not
/// answered: the tick is asked to load it, and the node asks again. Size 0
/// tells a node that is no longer a target (or asks for an image that was
/// replaced) to stop and forget; EN_FW_BUSY one that has to wait its turn.
static void answerFwGet(const uint8_t* mac, const uint8_t* data) {
    FwGetMsg g;
    memcpy(&g, data, sizeof(g));
    taskENTER_CRITICAL(&s_nodeMux);
    const int     idx = slotFor(mac, g.nodeId);
    const uint8_t st  = idx >= 0 ? s_fwSt[idx] : (uint8_t)nfr::ST_NONE;
    taskEXIT_CRITICAL(&s_nodeMux);
    if (idx < 0) return;

    FwChunkMsg     m;
    int            n   = -1;
    const uint32_t now = millis();
    taskENTER_CRITICAL(&s_fwMux);
    const NodeFwImage& im = s_fwImg;
    if (!im.size || !nfr::isOpen(st) || (g.imgId != EN_FW_ANY && g.imgId != im.imgId)) {
        n = espnowFillFwChunk(m, g.nodeId, 0, 0, 0, 0, 0, 0, nullptr, 0);
    } else if (nfr::busyFor(s_fwOwner, now - s_fwLastMs, g.nodeId)) {
        n = espnowFillFwChunk(m, g.nodeId, im.imgId, im.size, 0, im.minMv, im.attempt,
                              EN_FW_BUSY, nullptr, 0);
    } else {
        s_fwOwner  = g.nodeId;
        s_fwLastMs = now;
        // EN_FW_ANY is answered with the identity and the slice at 0 (§4.2).
        const uint32_t off = g.imgId == EN_FW_ANY ? 0 : g.offset;
        uint8_t len = 0;
        const int w = nfr::lookup(s_fwServe, off, im.size, len);
        if (w >= 0 && s_fwBuf)
            n = espnowFillFwChunk(m, g.nodeId, im.imgId, im.size, off, im.minMv, im.attempt, 0,
                                  s_fwBuf + w * nfr::WIN + (off - s_fwServe.w[w].base), len);
        if (g.imgId != EN_FW_ANY) { s_fwProgOff = off; s_fwProg = true; }
    }
    taskEXIT_CRITICAL(&s_fwMux);
    if (n > 0) esp_now_send(mac, (const uint8_t*)&m, (size_t)n);
}

