n3tk0/ESP32_Logger/src/espnow/EspNowIngest.cpp
#if ESP_IDF_VERSION_MAJOR >= 5
// Arduino core 3.x / IDF 5 replaced the bare MAC with a struct that also
// carries the signal strength. This firmware pins core 2.0.17, so this branch
// is compiled only by the core-3 probe environment — it is here so that
// migrating is a rebuild rather than a debugging session.
static void onRecv(const esp_now_recv_info_t* info, const uint8_t* data, int len) {
    const uint8_t* mac = info ? info->src_addr : nullptr;
    const int      rssi = (info && info->rx_ctrl) ? info->rx_ctrl->rssi : 0;
#else
static void onRecv(const uint8_t* mac, const uint8_t* data, int len) {
    // IDF 4.4 hands the callback no signal information at all. Left at zero
    // rather than filled with a guess: EspNowNode::rssi reading 0 means "this
    // build cannot tell you", which is true.
    const int rssi = 0;
#endif
    if (!mac) return;

    uint8_t type = 0;
    if (!espnowValidate(data, len, type)) { s_stats.malformed++; return; }

    if (type == EN_MSG_DISCOVER) {
        s_stats.discoverSeen++;
        // Parked, not verified: the HMAC is tens of microseconds of SHA-256
        // and this is the WiFi task. The tick does the arithmetic.
        if (!s_pendingValid) {
            memcpy(&s_pendingDiscover, data, sizeof(s_pendingDiscover));
            memcpy(s_pendingMac, mac, 6);
            s_pendingValid = true;
        }
        return;
    }
    if (type == EN_MSG_CFG_GET)    { answerCfgGet(mac, data); return; }
    if (type == EN_MSG_CFG_REPORT) { feedCfgReport(mac, data, len); return; }
    if (type == EN_MSG_FW_GET)     { answerFwGet(mac, data); return; }
    if (type != EN_MSG_DATA && type != EN_MSG_DATA2 && type != EN_MSG_CFG_ACK &&
        type != EN_MSG_FW_DONE) {
        // ACK, WELCOME and CFG are ours to send, not to receive. A collector
        // hearing one is either talking to itself or hearing a second
        // collector; there is nothing useful to do with it either way.
        return;
    }

    // QUEUE FIRST, ACK SECOND, and the order is the whole point.
    //
    // The ACK is what tells the node its report landed; on receiving one the
    // node clears the samples it was carrying — up to fifteen of them, an
    // outage's worth. Acknowledging before the enqueue meant a ring-full drop
    // still said "landed", and the node then threw away readings that had
    // reached no further than this function. A silent hole in the record,
    // visible only as a ringFull counter nobody was watching.
    //
    // Unacknowledged, the node keeps its buffer and brings the samples again
    // on its next wake, which is the right trade: a lost reading cannot be
    // recovered and a repeated one can be lived with.
    //
    // BUT IT IS NOT FREE, and an earlier version of this comment said it was.
    // espnowSeqCheck() drops a repeated SEQUENCE NUMBER, and the node does not
    // repeat one — main.cpp increments s_seq on the unacknowledged path too,
    // then re-sends the buffered samples inside a later frame alongside newer
    // ones. So the retransmission is not a duplicate frame the collector could
    // recognise; it is a new frame whose contents overlap.
    //
    // What that costs: samples from a frame that landed but whose ACK was lost
    // in the air are stored twice. The trend grid buckets by the reading's own
    // timestamp, so a repeat lands in the hour it belongs to and overwrites
    // rather than double-counting; the CSV gets two rows with the same stamp.
    // Deduplicating properly needs per-sample identity rather than per-frame,
    // which the wire format does not carry today.
    if (!ringPush(mac, type, data, len)) return;

    // A CFG_ACK or FW_DONE is not acknowledged: the node sends it and goes
    // back to sleep (or restarts into the new image).
    if (type == EN_MSG_CFG_ACK || type == EN_MSG_FW_DONE) return;

    // Safely outside the spinlock, and only now that the frame is somewhere
    // the tick will find it. DATA2 shares DATA's header, so nodeId and seq are
    // at the same offsets in both.
    sendAck(mac, data[3], enRdU16(data + 4));

    if (rssi) {
        taskENTER_CRITICAL(&s_nodeMux);
        EspNowNode* n = s_nodes.byMac(mac);
        if (n) n->rssi = (int8_t)rssi;
        taskEXIT_CRITICAL(&s_nodeMux);
    }
}

// ---------------------------------------------------------------------------
// The tick — ordinary task
// ---------------------------------------------------------------------------

/// Verify and complete a parked handshake. Returns true if a node was added.
static bool servicePendingDiscover() {
    if (!s_pendingValid) return false;

    DiscoverMsg d;
    uint8_t     mac[6];
    memcpy(&d, &s_pendingDiscover, sizeof(d));
    memcpy(mac, s_pendingMac, 6);
    s_pendingValid = false;      // released before the work, so a retry can park

    // Outside a pairing window, a node the table already holds is still
    // answered (docs/NODE_CONFIG.md §4.6): a node that slept through a network
    // handover, or whose router changed channel, finds the collector again on
    // its own sweep instead of waiting for somebody to press Pair. It is not
    // new trust — the MAC was adopted once already, and the tag below must
    // still verify — and it never takes a slot.
    if (!espnowPairingActive()) {
        taskENTER_CRITICAL(&s_nodeMux);
        const bool known = s_nodes.byMac(mac) != nullptr;
        taskEXIT_CRITICAL(&s_nodeMux);
        if (!known) return false;
    }

    // Verified with the shared helper, against exactly the region the node
    // signed with the same one. Two implementations of this is how a node
    // pairs with nothing while both sides look correct in isolation.
    if (!espnowVerifyTag((const uint8_t*)ESPNOW_LMK, (const uint8_t*)&d,
                         EN_DISCOVER_SIGNED_LEN, d.tag)) {
        s_stats.discoverBadSig++;
        return false;
    }

    uint8_t  assigned = 0;
    uint16_t interval = ESPNOW_DEFAULT_INTERVAL_S;
    taskENTER_CRITICAL(&s_nodeMux);
    // Reuse the slot this MAC already holds, so re-pairing a node the
    // collector already knows does not consume a second id.
    const EspNowNode* n = s_nodes.byMac(mac);
    if (!n) {
        for (uint8_t id = 1; id < 255 && !n; id++)
            if (!s_nodes.byId(id))
                n = s_nodes.add(mac, id, nullptr, ESPNOW_DEFAULT_INTERVAL_S);
    }
    if (n) { assigned = n->nodeId; interval = n->intervalS; }
    taskEXIT_CRITICAL(&s_nodeMux);

