n3tk0/ESP32_Logger/src/espnow/EspNowIngest.cpp
    if (!assigned) {
        Serial.println("[ESPNOW] pairing refused: node table is full");
        return false;
    }

    WelcomeMsg w{};
    // The node's OWN interval, not the default. Re-pairing a node whose wake
    // period had been changed would otherwise hand it the default back while
    // the collector's table went on expecting the configured one — so the node
    // would report on one schedule and be judged offline against another.
    w.intervalS = interval;
    w.epoch     = nowEpoch();
    w.channel   = currentChannel();

    // Which access point to look for when the channel moves. BSSID is exact;
    // SSID is the fallback for a mesh that changes the BSSID under you.
    const uint8_t* bssid = WiFi.BSSID();
    if (bssid) memcpy(w.bssid, bssid, 6);
    strncpy(w.ssid, WiFi.SSID().c_str(), sizeof(w.ssid) - 1);

    if (!espnowSignWelcome(w, (const uint8_t*)ESPNOW_LMK, assigned, mac))
        return false;

    // BROADCAST, AND BEFORE THE PEER IS ADDED. Both matter. The node cannot
    // receive an encrypted frame from a collector it has not yet added as a
    // peer, and it cannot add one until this message tells it the collector's
    // MAC — there is no ordering that resolves that, so the reply goes out in
    // the clear, signed, addressed by the target field inside it.
    //
    // Adding the encrypted peer afterwards is what makes every subsequent
    // frame encrypted: once the peer exists with encrypt=true, sends to it
    // are, and this broadcast would not have been.
    static const uint8_t BCAST[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
    esp_now_send(BCAST, (const uint8_t*)&w, sizeof(w));

    if (!addPeer(mac)) return false;
    s_stats.paired++;
    s_dirty = true;
    s_cfgMirrorGen = 0;
    s_fwMirrorGen  = 0;
    Serial.printf("[ESPNOW] paired node %u on channel %u\n", assigned, w.channel);
    return true;
}

/// Everything one frame implies for the node table, done under the lock.
///
/// Returns false when the frame should be dropped. On success `outId` holds
/// the node's pipeline id and `outSnap` a copy of the node — the caller needs
/// both AFTER releasing the lock, because RemoteIngest::put() takes a
/// spinlock of its own and nesting the two is how lock-ordering bugs are
/// born.
static bool acceptFrame(const RxFrame& f, char* outId, size_t outIdLen,
                        EspNowNode& outSnap) {
    bool ok = false;

    // DATA and DATA2 share the 12-byte header.
    Data2Header h;
    memcpy(&h, f.buf, sizeof(h));

    // The battery samples, gathered before the lock: DATA2 has to be walked
    // to find them, and a critical section is no place for a walk.
    uint16_t bMv[ESPNOW_MAX_SAMPLES];
    uint16_t bDt[ESPNOW_MAX_SAMPLES];
    int      nb = 0;
    if (f.type == EN_MSG_DATA) {
        const DataMsg* d = reinterpret_cast<const DataMsg*>(f.buf);
        for (uint8_t i = 0; i < h.count && i < ESPNOW_MAX_SAMPLES; i++) {
            EnvSample es;
            memcpy(&es, &d->s[i], sizeof(es));
            const float mv = enUnpackMv(es.vbat_mv);
            if (enIsAbsent(mv)) continue;
            bMv[nb] = (uint16_t)mv; bDt[nb++] = es.dt_s;
        }
    } else {
        Data2Header hh; Data2Cursor cur; Data2Sample smp;
        espnowData2Open(f.buf, f.len, hh, cur);
        while (nb < ESPNOW_MAX_SAMPLES && espnowData2Next(cur, smp)) {
            for (uint8_t k = 0; k < smp.n; k++) {
                const float v = smp.v[k].value;
                if (smp.v[k].metric != nodecfg::M_BATTERY_VOLTAGE || !(v > 0.0f && v < 65.0f))
                    continue;
                bMv[nb] = (uint16_t)(v * 1000.0f + 0.5f); bDt[nb++] = smp.dt_s;
                break;
            }
        }
    }

    // Filled under the lock, acted on after it is released: the log line writes
    // flash, which a critical section is the last place to do.
    bool    logSkew     = false;
    int32_t logSkewVal  = 0;
    char    logSkewId[sizeof(EspNowNode::id)] = {0};

    // Read once, out here. time() is a libc call that takes a lock of its own,
    // and the critical section below runs with interrupts off — the fewer
    // things reached from inside it, the better. It was already being called
    // in there for `base`; now it is called once, for both.
    const uint32_t ours = nowEpoch();

    taskENTER_CRITICAL(&s_nodeMux);
    EspNowNode* n = s_nodes.byId(h.nodeId);
    if (n) {
        const EspNowSeqVerdict v =
            espnowSeqCheck(n->haveSeq, n->lastSeq, h.seq, h.flags);
        if (v == EN_SEQ_DUPLICATE || v == EN_SEQ_STALE) {
            n->framesDropped++;
        } else {
            n->haveSeq    = true;
            n->lastSeq    = h.seq;
            n->lastSeenMs = millis();
            n->everSeen   = true;
            n->framesRx++;

            // How far this node's clock is from ours, when both sides have one.
            // The arithmetic and its two guards live in NodeTable.h, where the
            // host tests can reach them.
            int32_t skew = 0;
            if (espnowClockSkew(ours, h.epoch, skew)) {
                const int idx = s_nodes.indexOf(h.nodeId);
                if (idx >= 0) {
                    const int32_t mag = skew < 0 ? -skew : skew;
                    // Log on crossing the threshold, at most once an hour per
                    // node. Unsigned difference, so it stays right across the
                    // millis() wrap; the zero initial value makes the first
                    // offence log immediately rather than an hour into uptime.
                    if (mag >= (int32_t)ESPNOW_SKEW_WARN_S &&
                        (s_skewLoggedMs[idx] == 0 ||
                         (uint32_t)(millis() - s_skewLoggedMs[idx]) >= ESPNOW_SKEW_LOG_INTERVAL_MS)) {
                        s_skewLoggedMs[idx] = millis();
                        if (s_skewLoggedMs[idx] == 0) s_skewLoggedMs[idx] = 1;  // 0 means "never"
                        logSkew    = true;
                        logSkewVal = skew;
                        strncpy(logSkewId, n->id, sizeof(logSkewId) - 1);
                    }
                    s_skew[idx]     = skew;
                    s_haveSkew[idx] = true;
                }
            }

            const uint32_t base = h.epoch ? h.epoch : ours;
            for (int i = 0; i < nb; i++) {
                n->lastMv = bMv[i];
                const uint32_t ts = (base > bDt[i]) ? base - bDt[i] : base;
                batteryHistoryAdd(n->batt, ts, n->lastMv);
            }

            strncpy(outId, n->id, outIdLen - 1);
            outId[outIdLen - 1] = '\0';
            outSnap = *n;
            ok = true;
        }
    }
    taskEXIT_CRITICAL(&s_nodeMux);

    // A minute out is not a rounding error on a node that reports every minute:
    // it means either that the node has been running on its RC oscillator since
    // the last ACK it actually heard, or that the collector's own clock jumped.
    // Either way the backfill timestamps in that frame are a minute wrong, and
    // the only way anyone finds out is if it is written down — the serial
    // console is not attached to a device that is outdoors.
    if (logSkew) {
        Serial.printf("[ESPNOW] node %s clock is %ld s %s\n",
                      logSkewId, (long)(logSkewVal < 0 ? -logSkewVal : logSkewVal),
                      logSkewVal > 0 ? "behind" : "ahead");
        eventLogPrintf("boot#%u  ESPNOW_SKEW  node=%s  skew=%+ld s",
                       (unsigned)bootCount, logSkewId, (long)logSkewVal);
    }

    if (!n) {
        s_stats.unknownNode++;
        // Worth a log line and not just a counter: this is what a node whose
        // collector was reflashed looks like, and the MAC is what you need to
        // pair it again.
        Serial.printf("[ESPNOW] frame from unprovisioned node %u "
                      "(%02x:%02x:%02x:%02x:%02x:%02x)\n",
                      h.nodeId, f.mac[0], f.mac[1], f.mac[2],
                      f.mac[3], f.mac[4], f.mac[5]);
    } else if (!ok) {
        s_stats.replayed++;
    } else {
        s_stats.framesRx++;
    }
    return ok;
}

/// Hand one reading on: the newest sample of a frame to the mailbox, the
/// rest to the history queue. See the tick below for why the two differ.
static void landReading(const char* id, bool newest, const char* metric, float value,
                        const char* unit, uint32_t ts) {
    if (newest) {
        remoteIngest.put(id, metric, value, unit, ts);
    } else if (ts < 1000000000u) {
        // No clock anywhere — not on the node, not here — so a backdated
        // reading has no date to be filed under and putHistorical() would
        // refuse it. Counted separately from the overflow below, because the
        // two ask for opposite things: one wants a bigger queue, this one
        // wants NTP or an RTC.
        s_stats.historyNoClock++;
    } else if (!remoteIngest.putHistorical(id, metric, value, unit, ts)) {
        // The queue was full and shed its oldest entry to take this one.
        // Counted, because a backlog that keeps overflowing means the drain
        // is too slow for the burst size and that is a tuning fact, not a
        // mystery.
        s_stats.historyCollapsed++;
    }
}

/// A CFG_ACK: the node applied a rev, or refused it and said why.
static void handleCfgAck(const RxFrame& f) {
    CfgAckMsg a;
    memcpy(&a, f.buf, sizeof(a));
    taskENTER_CRITICAL(&s_nodeMux);
    const int idx = slotFor(f.mac, a.nodeId);
    taskEXIT_CRITICAL(&s_nodeMux);
    if (idx < 0) return;
    // Terminated inside their arrays — espnowValidate() refused anything else.
    nodeCfgEspnowAck(a.nodeId, a.rev, a.status == EN_CFG_OK, a.field, a.reason);
}

/// A completed CFG_REPORT, already answered from the callback: store it.
static void serviceCfgReport() {
    if (!s_reportReady) return;
    char     label[sizeof(EspNowNode::id)] = {0};
    uint16_t interval = 0;
    taskENTER_CRITICAL(&s_nodeMux);
    const EspNowNode* n = s_nodes.byId(s_asm.nodeId);
    if (n) { memcpy(label, n->id, sizeof(label) - 1); interval = n->intervalS; }
    taskEXIT_CRITICAL(&s_nodeMux);
    if (n) nodeCfgEspnowReport(s_asm.nodeId, s_asm.doc, s_asm.total, label, interval,
                               s_reportPlan);
    espnowCfgReset(s_asm);
    s_reportReady = false;
}

