n3tk0/ESP32_Logger/src/espnow/EspNowIngest.cpp
/// Refresh what the receive callback answers from — see the comment on
/// s_cfgDoc. Runs only when the store (or the table) has changed.
static void syncCfgMirrors() {
    const uint32_t gen = nodeCfgGeneration();
    if (gen == s_cfgMirrorGen) return;
    bool again = false;
    for (int i = 0; i < EspNowNodeTable::CAP; i++) {
        taskENTER_CRITICAL(&s_nodeMux);
        const bool     used    = s_nodes.at(i).used;
        const uint8_t  id      = s_nodes.at(i).nodeId;
        const bool     haveDoc = s_cfgDoc[i] != nullptr;
        const uint16_t docRev  = s_cfgDocRev[i];
        taskEXIT_CRITICAL(&s_nodeMux);

        NodeCfgRadio r = { false, 0, 0, 0 };
        if (used && !nodeCfgRadioState(id, r)) { again = true; continue; }
        const bool send = r.have && ncr::shouldSend(r.status, r.rev, r.applied);
        const bool keep = send && haveDoc && docRev == r.rev;

        char*    doc = nullptr;
        uint16_t len = 0;
        if (send && !keep) {
            char* buf = (char*)malloc(EN_CFG_MAX_TOTAL + 1);
            uint16_t rev = 0;
            const size_t n = buf ? nodeCfgRadioDoc(id, buf, EN_CFG_MAX_TOTAL + 1, rev) : 0;
            if (n && rev == r.rev) {
                char* fit = (char*)realloc(buf, n);
                doc = fit ? fit : buf;
                len = (uint16_t)n;
            } else {
                free(buf);
            }
        }

        char* old = nullptr;
        taskENTER_CRITICAL(&s_nodeMux);
        if (!keep) {
            old            = s_cfgDoc[i];
            s_cfgDoc[i]    = doc;
            s_cfgDocLen[i] = len;
            s_cfgDocRev[i] = r.rev;
        }
        s_cfgHave[i] = r.have;
        s_cfgRev[i]  = r.rev;
        s_cfgPend[i] = s_cfgDoc[i] != nullptr;
        taskEXIT_CRITICAL(&s_nodeMux);
        free(old);
    }
    if (!again) s_cfgMirrorGen = gen;
}

/// A FW_DONE (§4.3): the store maps it to a status. The transfer it ends is
/// released at once, so the next node need not wait out the idle timeout.
static void handleFwDone(const RxFrame& f) {
    FwDoneMsg d;
    memcpy(&d, f.buf, sizeof(d));
    taskENTER_CRITICAL(&s_nodeMux);
    const int idx = slotFor(f.mac, d.nodeId);
    taskEXIT_CRITICAL(&s_nodeMux);
    if (idx < 0) return;
    taskENTER_CRITICAL(&s_fwMux);
    if (s_fwOwner == d.nodeId) s_fwLastMs = millis() - nfr::IDLE_MS;
    taskEXIT_CRITICAL(&s_fwMux);
    nodeFwEspnowDone(d.nodeId, d.imgId, d.status, d.attempt, d.value);
}

/// Refresh s_fwSt and s_fwImg when the store (or the table) has changed. A
/// new or deleted image empties the windows — they hold the old one's bytes.
static void syncFwMirrors() {
    const uint32_t gen = nodeFwGeneration();
    if (gen == s_fwMirrorGen) return;
    NodeFwImage im;
    if (!nodeFwImage(nodefw::KIND_ESPNOW_C3, im)) return;   // busy: next pass
    uint8_t st[EspNowNodeTable::CAP];
    for (int i = 0; i < EspNowNodeTable::CAP; i++) {
        taskENTER_CRITICAL(&s_nodeMux);
        const bool    used = s_nodes.at(i).used;
        const uint8_t id   = s_nodes.at(i).nodeId;
        taskEXIT_CRITICAL(&s_nodeMux);
        st[i] = used ? nodeFwRadioStatus(id) : (uint8_t)nfr::ST_NONE;
        if (st[i] == NODEFW_ST_BUSY) return;
    }
    taskENTER_CRITICAL(&s_nodeMux);
    memcpy(s_fwSt, st, sizeof(st));
    taskEXIT_CRITICAL(&s_nodeMux);
    taskENTER_CRITICAL(&s_fwMux);
    if (im.serial != s_fwImg.serial || !im.size) nfr::serveReset(s_fwServe);
    s_fwImg = im;
    taskEXIT_CRITICAL(&s_fwMux);
    s_fwMirrorGen = gen;
}

/// §4.2, the loop's half: drop an idle transfer, pass progress on, and load
/// the window the callback asked for.
static void serviceFw() {
    syncFwMirrors();
    uint8_t* drop  = nullptr;
    taskENTER_CRITICAL(&s_fwMux);
    if (s_fwOwner && millis() - s_fwLastMs >= nfr::IDLE_MS) {
        s_fwOwner = 0;
        drop      = s_fwBuf;
        s_fwBuf   = nullptr;
        nfr::serveReset(s_fwServe);
    }
    const bool     prog    = s_fwProg && s_fwOwner;
    const uint8_t  owner   = s_fwOwner;
    const uint32_t off     = s_fwProgOff;
    const uint32_t imgId   = s_fwImg.imgId;
    const bool     needBuf = s_fwServe.req && !s_fwBuf;
    s_fwProg = false;
    taskEXIT_CRITICAL(&s_fwMux);
    free(drop);
    if (prog) nodeFwEspnowGet(owner, imgId, off);

    if (needBuf) {
        uint8_t* b = (uint8_t*)malloc(2 * nfr::WIN);
        if (!b) return;                      // the node asks again; so do we
        taskENTER_CRITICAL(&s_fwMux);
        if (!s_fwBuf) { s_fwBuf = b; b = nullptr; }
        taskEXIT_CRITICAL(&s_fwMux);
        free(b);
    }
    uint8_t  w  = 0;
    uint32_t at = 0;
    taskENTER_CRITICAL(&s_fwMux);
    const bool     load   = s_fwBuf && nfr::take(s_fwServe, w, at);
    uint8_t* const buf    = s_fwBuf;
    const uint32_t serial = s_fwImg.serial, size = s_fwImg.size;
    taskEXIT_CRITICAL(&s_fwMux);
    if (!load) return;
    // The window is empty while it is read (take()), so the callback cannot
    // answer from half-written bytes; and only this function frees the buffer.
    const int n = nodeFwRead(nodefw::KIND_ESPNOW_C3, serial, at, buf + w * nfr::WIN,
                             nfr::loadLen(at, size));
    taskENTER_CRITICAL(&s_fwMux);
    nfr::loaded(s_fwServe, w, n > 0 ? (uint32_t)n : 0);
    taskEXIT_CRITICAL(&s_fwMux);
}

void espnowIngestTick() {
    if (!s_up) return;

    servicePendingDiscover();
    serviceCfgReport();

    for (;;) {
        RxFrame f;
        taskENTER_CRITICAL(&s_ringMux);
        if (s_ringHead == s_ringTail) { taskEXIT_CRITICAL(&s_ringMux); break; }
        f = s_ring[s_ringHead];
        s_ringHead = (s_ringHead + 1) % RX_RING;
        taskEXIT_CRITICAL(&s_ringMux);

        if (f.type == EN_MSG_CFG_ACK) { handleCfgAck(f); continue; }
        if (f.type == EN_MSG_FW_DONE) { handleFwDone(f); continue; }

        char       id[sizeof(EspNowNode::id)];
        EspNowNode snap{};
        if (!acceptFrame(f, id, sizeof(id), snap)) continue;
        Data2Header h;                              // DATA's header too
        memcpy(&h, f.buf, sizeof(h));

        // The node's own clock is used when it has one, and it is load-bearing:
        // SensorManager stamps only a reading whose timestamp is zero, so what
        // is derived here is the time the reading is filed under. Zero when
        // neither side has a clock, which the history path below tests for.
        const uint32_t base = h.epoch ? h.epoch : nowEpoch();

