n3tk0/ESP32_Logger/src/espnow/EspNowIngest.cpp
        // WHERE EACH SAMPLE GOES
        //
        // The newest goes through RemoteIngest::put() — the mailbox slot, the
        // live value, overwritten by whatever comes next. That is what the
        // dashboard reads.
        //
        // Everything the node buffered through an outage goes through
        // putHistorical() instead, which queues rather than overwrites. Fed
        // through put() they would have collapsed into the one slot and
        // fourteen of fifteen readings would have been lost microseconds after
        // arriving — which is what this code did until the timestamps were
        // made authoritative end to end.
        //
        // Their timestamps are the node's own and survive: SensorManager only
        // stamps a reading whose timestamp is zero, and ProcessingTask keeps
        // backfilled readings out of the live ring and out of alert
        // evaluation while still folding them into storage and the trend grid.
        const uint8_t newest = (uint8_t)(h.count - 1);

        if (f.type == EN_MSG_DATA) {
            DataMsg msg;
            espnowDecodeData(f.buf, f.len, msg);
            for (uint8_t i = 0; i < msg.count && i < ESPNOW_MAX_SAMPLES; i++) {
                const EnvSample& s = msg.s[i];
                const uint32_t ts = (base > s.dt_s) ? base - s.dt_s : base;
                EspNowMetric m[EN_MAX_SAMPLE_METRICS];
                const int cnt = espnowExpandSample(s, m, EN_MAX_SAMPLE_METRICS);
                for (int k = 0; k < cnt; k++)
                    landReading(id, i == newest, m[k].metric, m[k].value, m[k].unit, ts);
            }
        } else {
            // DATA2 (§5): each value names its metric by catalogue id, and a
            // probe by its ordinal — named by the store, through the config
            // the node last reported, or the default probe_temp[_N] before it
            // has. (There, not here: the store's copy of the catalogue and its
            // string helpers is the one that is linked.)
            Data2Header hh;
            Data2Cursor cur;
            Data2Sample smp;
            espnowData2Open(f.buf, f.len, hh, cur);
            for (uint8_t i = 0; espnowData2Next(cur, smp); i++) {
                const uint32_t ts = (base > smp.dt_s) ? base - smp.dt_s : base;
                ncr::NamedValue nv[EN_DATA2_MAX_VALUES];
                const int cnt = nodeCfgData2Named(h.nodeId, smp, nv, EN_DATA2_MAX_VALUES);
                for (int k = 0; k < cnt; k++)
                    landReading(id, i == newest, nv[k].name, nv[k].value, nv[k].unit, ts);
            }
        }

        // The two figures the collector derives rather than receives,
        // recomputed from the history the samples above just extended.
        // Emitted here rather than per-sample because they are properties of
        // the node, not of any one reading.
        EspNowMetric d[EN_MAX_NODE_METRICS];
        const int dn = espnowBatteryMetrics(snap, d, EN_MAX_NODE_METRICS);
        for (int k = 0; k < dn; k++)
            remoteIngest.put(id, d[k].metric, d[k].value, d[k].unit, base);
    }

    // Persist on a provisioning change, and once a day so a reboot does not
    // cost the battery history. Not per frame: that would be a flash write a
    // minute per node, which is how a partition gets worn out.
    // s_lastDay advances only on a write that HAPPENED. It used to be set
    // first, which quietly turned the retry off: saveNodes() can return early
    // on its 60 s backoff, and on the daily path s_dirty is false, so nothing
    // would have brought the tick back. One skipped write and that day's
    // battery minima were gone — the history that takes five days to rebuild
    // before batteryDaysLeft() will answer at all.
    const uint32_t today = nowEpoch() / 86400u;
    if (s_dirty || (today != 0 && today != s_lastDay && s_nodes.count() > 0)) {
        if (saveNodes()) s_lastDay = today;
    }

    syncCfgMirrors();
    serviceFw();
}

// ---------------------------------------------------------------------------
// Lifecycle and accessors
// ---------------------------------------------------------------------------

bool espnowIngestBegin() {
    if (s_up) return true;

    // The radio has to be a station before ESP-NOW can ride it. This does not
    // start a connection — that is WiFiManager's job — it refuses to proceed
    // only if the interface is not there at all.
    if (WiFi.getMode() == WIFI_OFF) {
        Serial.println("[ESPNOW] WiFi is off — not starting");
        return false;
    }

    // MODEM SLEEP OFF, SAID OUT LOUD RATHER THAN ASSUMED.
    //
    // WIFI_PS_MIN_MODEM breaks ESP-NOW unicast while leaving broadcast
    // working, which is the failure this whole file's header warns about:
    // pairing succeeds, the node reports for years, and not one reading ever
    // arrives.
    //
    // modemSleepAllowed() in the sketch stops US from ENABLING it. That is
    // not the same as it being off: the Arduino-ESP32 default for a connected
    // station is WIFI_PS_MIN_MODEM, and nothing was ever turning it back off.
    // So the documented failure was not an edge case somebody might configure
    // their way into — it was the state the collector booted in.
    //
    // The node has always done this in linkBegin(). The collector now does the
    // same thing at the same point, and here rather than in the sketch because
    // this is the feature that requires it: a WiFi reconnect elsewhere cannot
    // quietly undo a decision made next to the radio that depends on it.
    if (esp_wifi_set_ps(WIFI_PS_NONE) != ESP_OK)
        Serial.println("[ESPNOW] could not turn modem sleep off — "
                       "unicast may not arrive");

    if (esp_now_init() != ESP_OK) {
        Serial.println("[ESPNOW] esp_now_init() failed");
        return false;
    }
    if (esp_now_set_pmk((const uint8_t*)ESPNOW_PMK) != ESP_OK)
        Serial.println("[ESPNOW] set_pmk() failed");

    esp_now_register_recv_cb(onRecv);
    addBroadcastPeer();

    loadNodes();
    {
        // Read-only open. A namespace that has never been written does not
        // exist, and begin() returns false for it — which is the ordinary
        // first-boot case, not an error: s_offlineIntervals stays 0 and
        // espnowGetOfflineIntervals() answers with the compile-time default.
        Preferences prefs;
        if (prefs.begin(ESPNOW_NVS_NS, true)) {
            const uint8_t stored = prefs.getUChar(ESPNOW_NVS_OFFLINE_IV, 0);
            prefs.end();
            // Validated on the way IN as well as on the way out. A value
            // written by an older build, or by anything else that touched this
            // namespace, must not be able to put the table in a state where
            // every node reads offline.
            s_offlineIntervals =
                (stored == 0 || (stored >= ESPNOW_OFFLINE_INTERVALS_MIN &&
                                 stored <= ESPNOW_OFFLINE_INTERVALS_MAX))
                ? stored : 0;
        }
    }
    for (int i = 0; i < EspNowNodeTable::CAP; i++) {
        const EspNowNode& n = s_nodes.at(i);
        if (n.used) addPeer(n.mac);
    }

    // A collector that knows no nodes listens for one. See the comment on
    // ESPNOW_BOOT_PAIRING_S: this is the entire provisioning interface until
    // there is a button for it.
    if (s_nodes.count() == 0) espnowBeginPairing(ESPNOW_BOOT_PAIRING_S);

    s_up = true;
    Serial.printf("[ESPNOW] up on channel %u, %d node(s)%s\n",
                  currentChannel(), s_nodes.count(),
                  espnowPairingActive() ? ", pairing open" : "");

    // Said out loud, because of what this particular default costs. The LMK is
    // both the link's encryption key and the only thing a DISCOVER tag proves
    // possession of — and a collector that knows no nodes opens a pairing
    // window by itself at boot (above). So a build that never passed
    // -DESPNOW_LMK will adopt a node from anyone in radio range who has read
    // this repository. Not refused, for the same reason the ingest token is
    // not: a deployed pair of devices sharing the default must keep talking
    // until their owner rebuilds both.
    if (memcmp(ESPNOW_LMK, "change-this-key!", 16) == 0) {
        Serial.println("[ESPNOW] WARNING: ESPNOW_LMK is the built-in default — "
                       "any node within range can pair. Rebuild collector AND "
                       "nodes with -DESPNOW_LMK='\"16-byte-secret!\"'.");
    }
    return true;
}

void espnowBeginPairing(uint32_t seconds) {
    s_pairUntilMs = millis() + seconds * 1000u;
    if (s_pairUntilMs == 0) s_pairUntilMs = 1;   // 0 is the "never opened" marker
    Serial.printf("[ESPNOW] pairing window open for %us\n", (unsigned)seconds);
}

bool espnowPairingActive() {
    if (s_pairUntilMs == 0) return false;
    // Signed difference, so the comparison stays correct across the millis()
    // wrap: a window opened just before it must not read as already expired.
    return (int32_t)(s_pairUntilMs - millis()) > 0;
}

