n3tk0/ESP32_Logger/src/espnow/EspNowIngest.cpp
// Either both halves take, or neither does.
//
// This used to mutate the table and then add the radio peer, so a peer that
// could not be added left the table already changed: a rename applied in RAM,
// s_dirty never set so it was never written, and the API returning an error
// over the top of it. The page then showed the new name until the next reboot
// showed the old one.
//
// The peer goes first now, because it is the half that can fail for reasons
// outside this table — the driver's peer list is a fixed twenty slots. And if
// the table refuses afterwards, a peer this call created is taken back out;
// one that was already there is left alone, since renaming an existing node
// must not cost it its peer.
bool espnowAddNode(const uint8_t mac[6], uint8_t nodeId, const char* label,
                   uint16_t intervalS) {
    const bool peerExisted = s_up && esp_now_is_peer_exist(mac);
    if (s_up && !addPeer(mac)) return false;

    taskENTER_CRITICAL(&s_nodeMux);
    const bool ok = s_nodes.add(mac, nodeId, label, intervalS) != nullptr;
    // A slot is reused, so whatever the previous occupant's clock was doing is
    // not this node's measurement. add() also returns the existing entry when
    // the node is merely being renamed — clearing there costs one report.
    if (ok) {
        const int idx = s_nodes.indexOf(nodeId);
        if (idx >= 0) {
            s_haveSkew[idx] = false; s_skew[idx] = 0; s_skewLoggedMs[idx] = 0;
            s_repHash[idx]  = 0;
        }
    }
    taskEXIT_CRITICAL(&s_nodeMux);

    if (!ok) {
        if (s_up && !peerExisted) esp_now_del_peer(mac);
        return false;
    }
    s_dirty = true;
    s_cfgMirrorGen = 0;
    s_fwMirrorGen  = 0;
    return true;
}

bool espnowUpdateNode(uint8_t nodeId, const char* label, uint16_t intervalS) {
    uint8_t mac[6];
    bool    found = false, same = false;
    taskENTER_CRITICAL(&s_nodeMux);
    const EspNowNode* n = s_nodes.byId(nodeId);
    if (n) {
        found = true;
        memcpy(mac, n->mac, 6);
        same = (!label || strcmp(label, n->id) == 0) && n->intervalS == intervalS;
    }
    taskEXIT_CRITICAL(&s_nodeMux);
    if (!found) return false;
    if (same) return true;
    return espnowAddNode(mac, nodeId, label, intervalS);
}

bool espnowRemoveNode(uint8_t nodeId) {
    uint8_t mac[6];
    bool found = false;

    taskENTER_CRITICAL(&s_nodeMux);
    const EspNowNode* n = s_nodes.byId(nodeId);
    if (n) {
        memcpy(mac, n->mac, 6);
        // Before remove(), while the slot still answers to this node id.
        const int idx = s_nodes.indexOf(nodeId);
        if (idx >= 0) {
            s_haveSkew[idx] = false; s_skew[idx] = 0; s_skewLoggedMs[idx] = 0;
            s_repHash[idx]  = 0;
        }
        s_nodes.remove(nodeId);
        found = true;
    }
    taskEXIT_CRITICAL(&s_nodeMux);

    if (!found) return false;
    if (s_up) esp_now_del_peer(mac);
    s_dirty = true;
    s_cfgMirrorGen = 0;
    s_fwMirrorGen  = 0;
    return true;
}

int espnowCopyNodes(EspNowNode* out, int maxOut) {
    if (!out || maxOut <= 0) return 0;
    int n = 0;
    taskENTER_CRITICAL(&s_nodeMux);
    for (int i = 0; i < EspNowNodeTable::CAP && n < maxOut; i++)
        if (s_nodes.at(i).used) out[n++] = s_nodes.at(i);
    taskEXIT_CRITICAL(&s_nodeMux);
    return n;
}

bool espnowNodeSkew(uint8_t nodeId, int32_t& outSkewS) {
    bool have = false;
    // The index lookup and the read of the parallel array have to happen under
    // the same lock: a remove() between them would have this reading a slot
    // that now belongs to a different node, or to none.
    taskENTER_CRITICAL(&s_nodeMux);
    const int idx = s_nodes.indexOf(nodeId);
    if (idx >= 0 && s_haveSkew[idx]) { outSkewS = s_skew[idx]; have = true; }
    taskEXIT_CRITICAL(&s_nodeMux);
    return have;
}

bool espnowAnyBatteryWarn() {
    taskENTER_CRITICAL(&s_nodeMux);
    const bool warn = s_nodes.anyBatteryWarn();
    taskEXIT_CRITICAL(&s_nodeMux);
    return warn;
}

int espnowOfflineCount() {
    // Both reads happen BEFORE the critical section. Neither is expensive, but
    // a section that runs with interrupts disabled should contain the table
    // walk and nothing else.
    const uint32_t now = millis();
    const uint8_t  iv  = espnowGetOfflineIntervals();
    taskENTER_CRITICAL(&s_nodeMux);
    const int c = s_nodes.offlineCount(now, iv);
    taskEXIT_CRITICAL(&s_nodeMux);
    return c;
}

const EspNowIngestStats& espnowStats() { return s_stats; }

uint8_t espnowGetOfflineIntervals() {
    return s_offlineIntervals ? s_offlineIntervals : (uint8_t)ESPNOW_OFFLINE_INTERVALS;
}

bool espnowSetOfflineIntervals(uint8_t n) {
    // Range-checked HERE and not only at the web handler, because this is the
    // function that writes flash. One is a node marked offline by a single
    // lost frame, which 2.4 GHz produces routinely — the dashboard would
    // flicker. Above 60 the threshold exceeds an hour even at the shortest
    // wake period, by which point "offline" has stopped meaning anything.
    // 0 stays legal and means "use the built-in default".
    if (n != 0 && (n < ESPNOW_OFFLINE_INTERVALS_MIN || n > ESPNOW_OFFLINE_INTERVALS_MAX))
        return false;

    // THE LIVE VALUE CHANGES ONLY IF THE WRITE LANDS. Assigning first meant a
    // full or worn flash left the running threshold changed and the caller told
    // it had failed — so the dashboard behaved one way until the next reboot
    // and another way after it, with nothing on screen to explain either.
    const uint8_t previous = s_offlineIntervals;
    s_offlineIntervals = n;

    Preferences prefs;
    // The namespace and key are ESPNOW_NVS_NS / ESPNOW_NVS_OFFLINE_IV in the
    // header. Spelling them literally in two places is how the doc comment came
    // to name a key ("en_offline_iv") that does not exist.
    if (!prefs.begin(ESPNOW_NVS_NS, false)) {
        s_offlineIntervals = previous;
        Serial.println("[ESPNOW] could not open NVS for the offline threshold");
        return false;
    }
    const bool ok = prefs.putUChar(ESPNOW_NVS_OFFLINE_IV, n) == sizeof(uint8_t);
    prefs.end();
    if (!ok) {
        s_offlineIntervals = previous;
        Serial.println("[ESPNOW] could not persist the offline threshold");
    }
    return ok;
}

#endif  // FEATURE_ESPNOW_INGEST
